Autodesk.Revit.DB.Fabrication.FabricationPartCompareType
Fabrication Part Comparison Types
Since:
2018
Since:
2018

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.ButtonAlias
Compare Fabrication Button Alias field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.CustomData
Compare all Fabrication Custom Data fields.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.PCFKey
Compare Fabrication PCFKey field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Alias
Compare Fabrication Alias field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Spool
Compare Fabrication Spool name field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Alt
Compare Fabrication Alt field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.ETag
Compare Fabrication ETag field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Zone
Compare Fabrication Zone field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Drawing
Compare Fabrication Drawing name field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.OrderNo
Compare Fabrication Order Number field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.BoxNo
Compare Fabrication Box Number field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Pallet
Compare Fabrication Pallet field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Service
Compare Fabrication Service.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Status
Compare Fabrication Status.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Section
Compare Fabrication Section field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.SkinGauge
Compare Fabrication Double Skin Material Gauge.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.SkinMaterial
Compare Fabrication Double Skin Material.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.CID
Compare Fabrication Custom Identifier (CID) number.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Description
Compare Fabrication Description Field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Filename
Compare Fabrication Item Filename.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Notes
Compare Fabrication Notes field.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Insulation
Compare Fabrication Insulation Material.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.DuctFacing
Compare Fabrication Duct Facing Type.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.MaterialGauge
Compare Fabrication Material's Gauge.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.InsulationSpecification
Compare Fabrication Insulation Specification.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Specification
Compare Fabrication Specification.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.Material
Compare Fabrication Material.

Autodesk.Revit.DB.Fabrication.FabricationPartCompareType.CutType
Compare Fabrication Cut Type data.